ga/artillery-tests/resultados_azure_test.txt
Test run id: thy7b_hzhxw73j9cdtzmgjbw6fhyxxynn3q_64ew
Phase started: Calentamiento (index: 0, duration: 15s) 16:42:38(+0200)

--------------------------------------
Metrics for period to: 16:42:40(+0200) (width: 0.409s)
--------------------------------------

http.codes.301: ................................................................ 5
http.downloaded_bytes: ......................................................... 0
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 10
http.response_time:
  min: ......................................................................... 55
  max: ......................................................................... 67
  mean: ........................................................................ 59.4
  median: ...................................................................... 58.6
  p95: ......................................................................... 61
  p99: ......................................................................... 61
http.responses: ................................................................ 5
vusers.created: ................................................................ 5
vusers.created_by_name.0: ...................................................... 5


Phase completed: Calentamiento (index: 0, duration: 15s) 16:42:53(+0200)

Phase started: Crecimiento (index: 1, duration: 5s) 16:42:53(+0200)

Phase completed: Crecimiento (index: 1, duration: 5s) 16:42:58(+0200)

Phase started: Pico (index: 2, duration: 5s) 16:42:58(+0200)

Phase completed: Pico (index: 2, duration: 5s) 16:43:03(+0200)

--------------------------------------
Metrics for period to: 16:42:50(+0200) (width: 9.505s)
--------------------------------------

http.codes.200: ................................................................ 46
http.codes.301: ................................................................ 50
http.downloaded_bytes: ......................................................... 1688465
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 48
  max: ......................................................................... 1987
  mean: ........................................................................ 692.6
  median: ...................................................................... 66
  p95: ......................................................................... 1720.2
  p99: ......................................................................... 1863.5
http.responses: ................................................................ 96
vusers.completed: .............................................................. 45
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1089.6
  max: ......................................................................... 2254.1
  mean: ........................................................................ 1636.6
  median: ...................................................................... 1686.1
  p95: ......................................................................... 2018.7
  p99: ......................................................................... 2101.1


--------------------------------------
Metrics for period to: 16:43:00(+0200) (width: 9.946s)
--------------------------------------

errors.ECONNRESET: ............................................................. 4
http.codes.200: ................................................................ 42
http.codes.301: ................................................................ 83
http.downloaded_bytes: ......................................................... 1613423
http.request_rate: ............................................................. 24/sec
http.requests: ................................................................. 177
http.response_time:
  min: ......................................................................... 47
  max: ......................................................................... 4603
  mean: ........................................................................ 712.3
  median: ...................................................................... 66
  p95: ......................................................................... 3752.7
  p99: ......................................................................... 4403.8
http.responses: ................................................................ 125
vusers.completed: .............................................................. 43
vusers.created: ................................................................ 94
vusers.created_by_name.0: ...................................................... 94
vusers.failed: ................................................................. 4
vusers.session_length:
  min: ......................................................................... 1262.9
  max: ......................................................................... 4870.4
  mean: ........................................................................ 2245.3
  median: ...................................................................... 1587.9
  p95: ......................................................................... 4492.8
  p99: ......................................................................... 4867


--------------------------------------
Metrics for period to: 16:43:10(+0200) (width: 9.937s)
--------------------------------------

errors.ECONNRESET: ............................................................. 1
http.codes.200: ................................................................ 54
http.codes.301: ................................................................ 87
http.downloaded_bytes: ......................................................... 1988651
http.request_rate: ............................................................. 27/sec
http.requests: ................................................................. 163
http.response_time:
  min: ......................................................................... 502
  max: ......................................................................... 8938
  mean: ........................................................................ 4107.4
  median: ...................................................................... 3072.4
  p95: ......................................................................... 8352
  p99: ......................................................................... 8520.7
http.responses: ................................................................ 141
vusers.completed: .............................................................. 53
vusers.created: ................................................................ 76
vusers.created_by_name.0: ...................................................... 76
vusers.failed: ................................................................. 1
vusers.session_length:
  min: ......................................................................... 5513.5
  max: ......................................................................... 10212.3
  mean: ........................................................................ 7596.9
  median: ...................................................................... 7407.5
  p95: ......................................................................... 9416.8
  p99: ......................................................................... 9801.2


--------------------------------------
Metrics for period to: 16:43:20(+0200) (width: 6.264s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 52
http.codes.200: ................................................................ 30
http.downloaded_bytes: ......................................................... 1013085
http.response_time:
  min: ......................................................................... 7670
  max: ......................................................................... 10000
  mean: ........................................................................ 9267.9
  median: ...................................................................... 9416.8
  p95: ......................................................................... 9999.2
  p99: ......................................................................... 9999.2
http.responses: ................................................................ 30
vusers.completed: .............................................................. 27
vusers.failed: ................................................................. 52
vusers.session_length:
  min: ......................................................................... 10059.6
  max: ......................................................................... 13440.6
  mean: ........................................................................ 11396.8
  median: ...................................................................... 11274.1
  p95: ......................................................................... 13230.3
  p99: ......................................................................... 13230.3


All VUs finished. Total time: 37 seconds

--------------------------------
Summary report @ 16:43:16(+0200)
--------------------------------

errors.ECONNRESET: ............................................................. 5
errors.ETIMEDOUT: .............................................................. 52
http.codes.200: ................................................................ 172
http.codes.301: ................................................................ 225
http.downloaded_bytes: ......................................................... 6303624
http.request_rate: ............................................................. 14/sec
http.requests: ................................................................. 450
http.response_time:
  min: ......................................................................... 47
  max: ......................................................................... 10000
  mean: ........................................................................ 2551.6
  median: ...................................................................... 1274.3
  p95: ......................................................................... 9047.6
  p99: ......................................................................... 9999.2
http.responses: ................................................................ 397
vusers.completed: .............................................................. 168
vusers.created: ................................................................ 225
vusers.created_by_name.0: ...................................................... 225
vusers.failed: ................................................................. 57
vusers.session_length:
  min: ......................................................................... 1089.6
  max: ......................................................................... 13440.6
  mean: ........................................................................ 5241.3
  median: ...................................................................... 4492.8
  p95: ......................................................................... 11501.8
  p99: ......................................................................... 13230.3